use TTTS;

INSERT INTO storeApp_product VALUES(1,'product/苗栗貓裏紅茶.jpg','苗栗貓裏紅茶',100,675,
'商品規格
    品名 : 2018苗栗貓裏紅茶-銀質獎
    容量 : 75g / 罐
    成分 : 茶葉
    產地 : 台灣-銅鑼-農林銅鑼茶園
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);

INSERT INTO storeApp_product VALUES(2,'product/有機蜜香紅茶.jpg','有機蜜香紅茶',100,350,
'商品規格
    品名 : 有機蜜香紅茶
    容量 : 45g / 罐
    成分 : 有機茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-三峽-農林熊空生態有機茶園
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
商品特色
    嫩採茶菁經小綠葉蟬著涎後，香氣清雅，入喉滿是甘醇蜜香，溫潤而滑順的口感，不僅在舌尖綻放甘甜，口感層次多變，其獨特芬芳的餘韻更是口中四溢，久久不散。
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);  

INSERT INTO storeApp_product VALUES(3,'product/大溪蜜香紅茶.jpg','大溪-蜜香紅茶(自然農法)',100,460,
'商品規格
    品名 : 大溪-蜜香紅茶(自然農法)
    容量 : 70g / 罐
    成分 : 台灣茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-桃園大溪-農林阿姆坪茶園
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);  

INSERT INTO storeApp_product VALUES(4,'product/有機沁蜜紅茶.jpg','有機沁蜜紅茶',100,400,
'商品規格
    品名 : 有機沁蜜紅茶
    容量 : 50g / 罐
    成分 : 台灣-有機茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-三峽-農林熊空生態有機茶園
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    熱泡方式: 
    茶葉: 約放入1/3壺的茶葉量
    水溫: 90℃熱水沖泡
    時間: 第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒(可依個人喜好反覆沖泡4-6回)

    冷泡方式: 
    將6g茶葉投入600cc冷水壺中，輕搖容器後, 放入冰箱靜置6-8小時，即可飲用甘冽冷泡茶。(可依個人濃淡喜好增減茶葉量，勿浸泡超過24小時)',now(),1);  

INSERT INTO storeApp_product VALUES(5,'product/沁蜜紅茶.jpg','沁蜜紅茶',100,380,
'商品規格
    品名 : 沁蜜紅茶
    容量 : 75g / 包
    成分 : 台灣茶葉
    產地 : 台灣-銅鑼-農林銅鑼茶園
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    商品特色 ： 採摘自農林三義、銅鑼茶園，嫩採茶菁經小綠葉蟬著涎後，香氣清雅，入喉滿是甘醇蜜香，口感溫潤滑順。品質皆經檢驗合格，安全、安心無虞。
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);  

INSERT INTO storeApp_product VALUES(6,'product/大溪-紅玉紅茶(自然農法).jpg','大溪-紅玉紅茶(自然農法)',100,650,
'商品規格
    品名 : 大溪-紅玉紅茶(自然農法)
    容量 : 70g / 罐
    成分 : 台灣茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-桃園大溪-農林阿姆坪茶園
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);  

INSERT INTO storeApp_product VALUES(7,'product/嚴選紅玉紅茶.jpg','嚴選紅玉紅茶',100,450,
'商品規格
    品名 : 嚴選紅玉紅茶(台茶十八號)
    容量 : 50g / 罐
    成分 : 台灣茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-魚池-農林漁池茶園
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);  

INSERT INTO storeApp_product VALUES(8,'product/仙女紅茶.jpg','仙女紅茶',100,130,
'商品規格
    品名 : 仙女紅茶
    容量 : 200g / 包
    成分 : 茶葉
    產地 : 斯里蘭卡、台灣
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    產品特色 : 有別於一般紅茶的苦澀，仙女紅茶有著鮮明而濃郁的特殊風味。遵循古法精製而成，茶湯順口無澀感，飲後鬱抑消散，是傳統道地的家鄉口味。
建議沖泡方式
    馬克杯沖泡法：取5公克仙女紅茶置入250c.c.容量的馬克杯內，將沸水由上而下沖泡，讓茶葉均勻旋轉而上，可將茶香釋放出來。靜置約60~90秒後（依個人口味喜好調整時間長短），將茶水濾出，即可享用。
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
    泡沫茶飲沖泡法：
    一、正港古早紅茶冰
    1.依比例將50公克仙女紅茶及50公克決明子放入鍋中。
    2.將5,000c.c.的煮沸開水緩緩倒入，蓋上鍋蓋燜泡10~15分鐘後，再將仙女紅茶與決明子濾出。
    3.依口味及喜好倒入適量黑糖或二砂糖，快速攪拌至完全溶解。
    4.加入冰塊至完全降溫，再放冰箱冷藏，飲用時加入碎冰即可享用。
    
    二、特調好美熱奶茶
    1.依標準茶水比例每100公克仙女紅茶加入4,000c.c.的煮沸開水。
    2.蓋上鍋蓋燜泡8分鐘後，再將茶水濾出。
    3.依口味及喜好添加適量二砂糖、煉乳或鮮奶，攪拌至完全溶解，即可享用。
    
    三、港式檸檬凍飲
    1.依標準茶水比例每100公克仙女紅茶加入5,000c.c.的煮沸開水。
    2.蓋上鍋蓋燜泡6~8分鐘後，再將茶水濾出。
    3.依口味及喜好添加適量果糖或蜂蜜攪拌均勻，加入冰塊至完全降溫，再放冰箱冷藏。
    4.飲用時，放入切片黃檸檬擠汁連片加入拌勻，即可享用。',now(),1);  

INSERT INTO storeApp_product VALUES(9,'product/日月紅茶.jpg','日月紅茶',100,150,
'商品規格
    品名 : 日月紅茶
    容量 : 150g / 包
    成分 : 茶葉
    產地 : 斯里蘭卡、台灣
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    產品特色 : 精選飽滿豐盈的茶葉製成，茶湯清澈豔紅，具有濃郁果香，滋味甘潤醇美。
建議沖泡方式
    取5公克日月紅茶置入250c.c.容量的馬克杯內，將沸水由上而下沖泡，讓茶葉均勻旋轉而上，可將茶香釋放出來。靜置約60~90秒後（依個人口味喜好調整時間長短），將茶水濾出，即可享用。',now(),1);

INSERT INTO storeApp_product VALUES(10,'product/蘭韻紅茶.jpg','蘭韻紅茶',100,250,
'商品規格
    品名 : 蘭韻紅茶
    容量 : 50g / 包
    成分 : 茶葉
    產地 : 南投縣鹿谷鄉
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    產品特色 : 艷紅而透亮，帶濃郁的蘭花香、果香，微涼喉的口感（四年生新茶樹表現的氣味非凡）',now(),1);    

INSERT INTO storeApp_product VALUES(11,'product/鹿谷紅茶.jpg','鹿谷紅茶',100,180,
'商品規格
    品名 : 鹿谷紅茶
    容量 : 60g / 包
    成分 : 茶葉
    產地 : 南投縣鹿谷鄉
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    產品特色 : 帶有小葉種烏龍茶的品種果香，滋味相對甜滑順口',now(),1);    