USE TTTS;

INSERT INTO storeApp_store VALUES(1,'北科老茶','台北市大安區忠孝東路三段1號','0227712171','60');

INSERT INTO storeApp_teatype VALUES(1,'紅茶','teaType/紅茶.jpg');
INSERT INTO storeApp_teatype VALUES(2,'綠茶','teaType/綠茶.jpg');
INSERT INTO storeApp_teatype VALUES(3,'烏龍茶','teaType/烏龍茶.jpg');

INSERT INTO storeApp_product VALUES(1,'product/苗栗貓裏紅茶.jpg','苗栗貓裏紅茶',100,675,
'商品規格
    品名 : 2018苗栗貓裏紅茶-銀質獎
    容量 : 75g / 罐
    成分 : 茶葉
    產地 : 台灣-銅鑼-農林銅鑼茶園
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);

INSERT INTO storeApp_product VALUES(2,'product/有機蜜香紅茶.jpg','有機蜜香紅茶',100,350,
'商品規格
    品名 : 有機蜜香紅茶
    容量 : 45g / 罐
    成分 : 有機茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-三峽-農林熊空生態有機茶園
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
商品特色
    嫩採茶菁經小綠葉蟬著涎後，香氣清雅，入喉滿是甘醇蜜香，溫潤而滑順的口感，不僅在舌尖綻放甘甜，口感層次多變，其獨特芬芳的餘韻更是口中四溢，久久不散。
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);  

INSERT INTO storeApp_product VALUES(3,'product/大溪蜜香紅茶.jpg','大溪-蜜香紅茶(自然農法)',100,460,
'商品規格
    品名 : 大溪-蜜香紅茶(自然農法)
    容量 : 70g / 罐
    成分 : 台灣茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-桃園大溪-農林阿姆坪茶園
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);  

INSERT INTO storeApp_product VALUES(4,'product/有機沁蜜紅茶.jpg','有機沁蜜紅茶',100,400,
'商品規格
    品名 : 有機沁蜜紅茶
    容量 : 50g / 罐
    成分 : 台灣-有機茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-三峽-農林熊空生態有機茶園
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    熱泡方式: 
    茶葉: 約放入1/3壺的茶葉量
    水溫: 90℃熱水沖泡
    時間: 第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒(可依個人喜好反覆沖泡4-6回)

    冷泡方式: 
    將6g茶葉投入600cc冷水壺中，輕搖容器後, 放入冰箱靜置6-8小時，即可飲用甘冽冷泡茶。(可依個人濃淡喜好增減茶葉量，勿浸泡超過24小時)',now(),1);  

INSERT INTO storeApp_product VALUES(5,'product/沁蜜紅茶.jpg','沁蜜紅茶',100,380,
'商品規格
    品名 : 沁蜜紅茶
    容量 : 75g / 包
    成分 : 台灣茶葉
    產地 : 台灣-銅鑼-農林銅鑼茶園
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    商品特色 ： 採摘自農林三義、銅鑼茶園，嫩採茶菁經小綠葉蟬著涎後，香氣清雅，入喉滿是甘醇蜜香，口感溫潤滑順。品質皆經檢驗合格，安全、安心無虞。
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);  

INSERT INTO storeApp_product VALUES(6,'product/大溪-紅玉紅茶(自然農法).jpg','大溪-紅玉紅茶(自然農法)',100,650,
'商品規格
    品名 : 大溪-紅玉紅茶(自然農法)
    容量 : 70g / 罐
    成分 : 台灣茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-桃園大溪-農林阿姆坪茶園
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);  

INSERT INTO storeApp_product VALUES(7,'product/嚴選紅玉紅茶.jpg','嚴選紅玉紅茶',100,450,
'商品規格
    品名 : 嚴選紅玉紅茶(台茶十八號)
    容量 : 50g / 罐
    成分 : 台灣茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-魚池-農林漁池茶園
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：90℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置45秒，後續沖泡可稍微延長10~30秒',now(),1);  

INSERT INTO storeApp_product VALUES(8,'product/仙女紅茶.jpg','仙女紅茶',100,130,
'商品規格
    品名 : 仙女紅茶
    容量 : 200g / 包
    成分 : 茶葉
    產地 : 斯里蘭卡、台灣
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    產品特色 : 有別於一般紅茶的苦澀，仙女紅茶有著鮮明而濃郁的特殊風味。遵循古法精製而成，茶湯順口無澀感，飲後鬱抑消散，是傳統道地的家鄉口味。
建議沖泡方式
    馬克杯沖泡法：取5公克仙女紅茶置入250c.c.容量的馬克杯內，將沸水由上而下沖泡，讓茶葉均勻旋轉而上，可將茶香釋放出來。靜置約60~90秒後（依個人口味喜好調整時間長短），將茶水濾出，即可享用。
                                         
    泡沫茶飲沖泡法：
    一、正港古早紅茶冰
    1.依比例將50公克仙女紅茶及50公克決明子放入鍋中。
    2.將5,000c.c.的煮沸開水緩緩倒入，蓋上鍋蓋燜泡10~15分鐘後，再將仙女紅茶與決明子濾出。
    3.依口味及喜好倒入適量黑糖或二砂糖，快速攪拌至完全溶解。
    4.加入冰塊至完全降溫，再放冰箱冷藏，飲用時加入碎冰即可享用。
    
    二、特調好美熱奶茶
    1.依標準茶水比例每100公克仙女紅茶加入4,000c.c.的煮沸開水。
    2.蓋上鍋蓋燜泡8分鐘後，再將茶水濾出。
    3.依口味及喜好添加適量二砂糖、煉乳或鮮奶，攪拌至完全溶解，即可享用。
    
    三、港式檸檬凍飲
    1.依標準茶水比例每100公克仙女紅茶加入5,000c.c.的煮沸開水。
    2.蓋上鍋蓋燜泡6~8分鐘後，再將茶水濾出。
    3.依口味及喜好添加適量果糖或蜂蜜攪拌均勻，加入冰塊至完全降溫，再放冰箱冷藏。
    4.飲用時，放入切片黃檸檬擠汁連片加入拌勻，即可享用。',now(),1);  

INSERT INTO storeApp_product VALUES(9,'product/日月紅茶.jpg','日月紅茶',100,150,
'商品規格
    品名 : 日月紅茶
    容量 : 150g / 包
    成分 : 茶葉
    產地 : 斯里蘭卡、台灣
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    產品特色 : 精選飽滿豐盈的茶葉製成，茶湯清澈豔紅，具有濃郁果香，滋味甘潤醇美。
建議沖泡方式
    取5公克日月紅茶置入250c.c.容量的馬克杯內，將沸水由上而下沖泡，讓茶葉均勻旋轉而上，可將茶香釋放出來。靜置約60~90秒後（依個人口味喜好調整時間長短），將茶水濾出，即可享用。',now(),1);

INSERT INTO storeApp_product VALUES(10,'product/蘭韻紅茶.jpg','蘭韻紅茶',100,250,
'商品規格
    品名 : 蘭韻紅茶
    容量 : 50g / 包
    成分 : 茶葉
    產地 : 南投縣鹿谷鄉
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    產品特色 : 艷紅而透亮，帶濃郁的蘭花香、果香，微涼喉的口感（四年生新茶樹表現的氣味非凡）',now(),1);    

INSERT INTO storeApp_product VALUES(11,'product/鹿谷紅茶.jpg','鹿谷紅茶',100,180,
'商品規格
    品名 : 鹿谷紅茶
    容量 : 60g / 包
    成分 : 茶葉
    產地 : 南投縣鹿谷鄉
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    產品特色 : 帶有小葉種烏龍茶的品種果香，滋味相對甜滑順口',now(),1);    

INSERT INTO storeApp_product VALUES(12,'product/有機青心甘綠茶.jpg','有機青心甘綠茶',100,420,
'商品規格
    品名 : 有機青心甘綠茶
    容量 : 45g / 罐
    成分 : 台灣-有機茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-三峽-農林熊空生態有機茶園
    保存期限 : 2年(未開封)
    有限日期 : 詳細見外包裝標示
    產品特色 : 在無污染的生態茶園種植青心烏龍、青心甘仔、青心大冇等茶種。鮮採的新芽嫩葉，精煉出蜜綠茶湯，入喉甘甜芬芳，滋味清新鮮活，蓄含淡淡海苔香氣，令人齒頰留香，彷彿親臨森林般的自在鮮在
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：85℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置40秒，後續沖泡可稍微延長10~30秒',now(),2);    

INSERT INTO storeApp_product VALUES(13,'product/有機碧玉綠茶.jpg','有機碧玉綠茶',100,420,
'商品規格
    品名 : 有機碧玉綠茶
    容量 : 50g / 罐
    成分 : 台灣-有機茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-三峽-農林熊空生態有機茶園
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
    產品特色 : 人工手採自農林熊空有機茶園，茶原料以青心烏龍品種為主，茶菁富含兒茶素等天然成份，茶湯碧綠清澈，口感醇厚、滋味濃郁，蓄含淡淡海苔香氣，漸進回甘滋味，清新鮮爽，每包產品皆經慈心認證。
建議沖泡方式
    熱泡方式: 
        茶葉: 約放入1/3壺的茶葉量 
        水溫: 85℃熱水沖泡 時間: 第一泡靜置40秒，第二回靜置30秒，第三回靜置40秒，後續沖泡可稍微延長10~30秒(可依個人喜好反覆沖泡4-6回)

    冷泡方式: 將6g茶葉投入600cc冷水壺中，輕搖容器後, 放入冰箱靜置6-8小時，即可飲用甘冽冷泡茶。(可依個人濃淡喜好增減茶葉量，勿浸泡超過24小時)',now(),2);    

INSERT INTO storeApp_product VALUES(14,'product/大溪青心甘綠茶.jpg','大溪-青心甘綠茶',100,490,
'商品規格
    品名 : 大溪-青心甘綠茶
    容量 : 70g / 罐
    成分 : 台灣茶葉
    產地 : 台灣-桃園大溪-農林阿姆坪茶園
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
    產品特色 : 老茶廠傳承日治時期傳統製茶工藝，由古老機器所揉捻製作出的綠茶，其特有的捲曲條形外觀，除了訴說歲月的流轉，也重現原生原作傳統的自然甘甜。
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：85℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置40秒，後續沖泡可稍微延長10~30秒',now(),2);    

INSERT INTO storeApp_product VALUES(15,'product/嚴選碧螺春綠茶.jpg','台灣農林-嚴選碧螺春綠茶',100,500,
'商品規格
    品名 : 台灣農林-嚴選碧螺春綠茶
    容量 : 50g / 罐
    成分 : 台灣茶葉
    產地 : 台灣
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：85℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置40秒，後續沖泡可稍微延長10~30秒',now(),2);    

INSERT INTO storeApp_product VALUES(16,'product/【不二堂】三峽龍井茶.jpg','【不二堂】三峽龍井茶',100,500,
'商品規格
    品名 : 【不二堂】三峽龍井茶
    容量 : 50g / 罐
    成分 : 台灣茶葉
    產地 : 台灣
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    置茶量取3克茶葉注入150CC水，80度C水溫沖泡。第一泡浸泡30秒，第二泡20秒，第三泡30秒，爾後每泡時間增加5秒，可泡六泡以上。',now(),2);    

INSERT INTO storeApp_product VALUES(17,'product/阿里山烏龍茶.jpg','嚴選阿里山烏龍茶',100,950,
'商品規格
    品名 : 嚴選阿里山烏龍茶
    容量 : 150g / 罐
    成分 : 茶葉
    產地 : 台灣
    保存期限 : 2年
    有限日期 : 詳細見外包裝標示
    特色 : 茶葉源自阿里山茶區，當地氣候涼爽寒冷，早晚雲霧繚繞，日照時間少，優質的環境才能培養出柔軟厚實的茶菁。茶菁果膠質含量高，色澤翠綠鮮活，香氣淡雅輕甜，口感醇厚回甘，是高山茶中的絕品。
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/4-1/5壺的茶葉量
    水溫：100℃熱水沖泡
    時間：第一泡靜置50秒，第二回靜置45秒，第三回靜置60秒，後續沖泡可稍微延長10~30秒',now(),3);    

INSERT INTO storeApp_product VALUES(18,'product/手採高山烏龍茶.jpg','手採高山烏龍茶',100,800,
'商品規格
    品名 : 手採高山烏龍茶
    容量 : 300g / 包
    成分 : 茶葉
    產地 : 台灣
    保存期限 : 2年（未開封）
    有限日期 : 詳細見外包裝標示
    特色 :   茶區氣侯涼爽寒冷，培養出柔軟厚實的茶菁，芽葉柔軟，葉肉厚實，色澤翠綠，香氣淡雅。
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/4-1/5壺的茶葉量
    水溫：100℃熱水沖泡
    時間：第一泡靜置50秒，第二回靜置45秒，第三回靜置60秒，後續沖泡可稍微延長10~30秒',now(),3);    

INSERT INTO storeApp_product VALUES(19,'product/清香烏龍茶.jpg','清香烏龍茶',100,700,
'商品規格
    品名 : 清香烏龍茶
    容量 : 300g / 包
    成分 : 茶葉
    產地 : 台灣
    保存期限 : 2年（未開封）
    有限日期 : 詳細見外包裝標示
    特色 :   輕度發酵，茶湯清新亮黃，特殊清透滋味，入喉甘甜有如沐浴在青青茶園，令人難忘的清新滋味。
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/4-1/5壺的茶葉量
    水溫：100℃熱水沖泡
    時間：第一泡靜置50秒，第二回靜置45秒，第三回靜置60秒，後續沖泡可稍微延長10~30秒',now(),3);    

INSERT INTO storeApp_product VALUES(20,'product/有機東方美人茶.jpg','有機東方美人茶',100,800,
'商品規格
    品名 : 有機東方美人茶
    容量 : 50g / 罐
    成分 : 台灣-有機茶葉（無使用化肥、農藥、香精、色素）
    產地 : 台灣-銅鑼-農林銅鑼有機茶園
    保存期限 : 2年（未開封）
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：85℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置40秒，後續沖泡可稍微延長10~30秒',now(),3);


INSERT INTO storeApp_product VALUES(21,'product/嚴選苗栗東方美人茶.jpg','嚴選苗栗東方美人茶',100,600,
'商品規格
    品名 : 嚴選苗栗東方美人茶
    容量 : 50g / 罐
    成分 : 茶葉
    產地 : 台灣
    保存期限 : 2年（未開封）
    有限日期 : 詳細見外包裝標示
建議沖泡方式
    茶葉：取200c.c.茶壺，投入1/3壺的茶葉量
    水溫：85℃熱水沖泡
    時間：第一泡靜置40秒，第二回靜置30秒，第三回靜置40秒，後續沖泡可稍微延長10~30秒',now(),3);    

INSERT INTO storeApp_product VALUES(22,'product/【京盛宇】 罐裝原葉茶–輕焙杉林溪烏龍.jpg','【京盛宇】輕焙杉林溪烏龍',100,1080,
'商品規格
    品名 : 【京盛宇】 罐裝原葉茶–輕焙杉林溪烏龍
    容量 : 100g / 罐
    成分 : 台灣茶葉
    產地 : 台灣-南投杉林溪
    保存期限 : 2年（未開封）
    有限日期 : 詳細見外包裝標示',now(),3);    

INSERT INTO storeApp_product VALUES(23,'product/【龍源茶品】傳統滋味凍頂烏龍茶葉.jpg','【龍源茶品】傳統滋味凍頂烏龍茶葉',100,330,
'商品規格
    品名 : 【龍源茶品】傳統滋味凍頂烏龍茶葉
    容量 : 150g / 罐
    成分 : 台灣茶葉
    產地 : 台灣
    保存期限 : 2年（未開封）
    有限日期 : 詳細見外包裝標示',now(),3);    

INSERT INTO storeApp_product VALUES(24,'product/開門茶堂 正欉鐵觀音.jpg','開門茶堂 正欉鐵觀音',100,720,
'商品規格
    品名 : 開門茶堂 正欉鐵觀音
    容量 : 75g / 罐
    成分 : 台灣茶葉
    產地 : 台灣三峽老欉
    保存期限 : 2年（未開封）
    有限日期 : 詳細見外包裝標示',now(),3);    

INSERT INTO storeApp_product VALUES(25,'product/【峨眉茶行】凍頂老茶.jpg','【峨眉茶行】凍頂老茶',100,800,
'商品規格
    品名 : 【峨眉茶行】凍頂老茶
    容量 : 150g / 罐
    成分 : 茶葉
    產地 : 台灣
    保存期限 : 10年
    有限日期 : 詳細見外包裝標示
    特色 : 入口濃醇溫潤， 自然回甘喉韻足， 有老茶特有的陳年香氣， 以及淡淡的木質香， 味道沉穩舒適。',now(),3);


INSERT INTO storeApp_discount VALUES(1,500,now(),"2019-03-31","冬季特賣");
INSERT INTO storeApp_seasoningdiscount VALUES(1,3000);

INSERT INTO storeApp_discount VALUES(2,0,now(),"2019-03-31","滿額免運費");
INSERT INTO storeApp_shippingdiscount VALUES(2,499);

INSERT INTO storeApp_discount VALUES(3,50,now(),"2019-03-31","紅茶好喝");
INSERT INTO storeApp_productdiscount VALUES(3,1);

INSERT INTO storeApp_discount VALUES(4,0.85,now(),"2019-03-31","冬季幫幫我");
INSERT INTO storeApp_seasoningdiscount VALUES(4,2000);

INSERT INTO storeApp_discount VALUES(5,10,now(),"2019-03-31","10塊還人家");
INSERT INTO storeApp_seasoningdiscount VALUES(5,0);